app/views/users/show.html.erb

	</aside>
	<% if @user.microposts.any? %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 3]]