app/views/shared/_user_view.html.erb

	<h3><%= current_user.name %></h3>
	<p><%= pluralize(current_user.microposts.count, "Post") %></p>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]