app/controllers/static_pages_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND (user_id = 2) ORDER BY created_at DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ? AND (user_id = 2)  [["user_id", 2]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? AND (user_id = 2) ORDER BY created_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def home
  	if signed_in?
        @micropost = current_user.microposts.build
        @feed_items = current_user.feed.paginate(page: params[:page], per_page: 6)
        @posts = current_user.posts.order(updated_at: :desc)
        @post = current_user.posts.first